package custerror

type Error struct {
	Code int    `json:"code"`
	Msg  string `json:"msg"`
}

var errorMessage = map[int]string{
	//共用错误
	1000: "参数不能为空",

	2000: "主播不存在",
	2001: "关注主播失败",
	2002: "取消关注主播失败",
	2003: "获取主播列表失败",
	2004: "主播计数失败",
	3000: "获取视频列表失败",
	3001: "视频收藏失败",
	3002: "取消收藏失败",
	3003: "视频不存在",
	3004: "视频弹幕推送失败",
	3005: "视频计数失败",
	4000: "用户未登录",
	4001: "用户登录失败",
	4002: "用户验证失败",
	4003: "用户注册失败",
	4004: "获取用户id失败",
	4005: "用户不存在",
	5000: "游戏不存在",
	5001: "举报选项不能为空",
	5002: "被举报者信息获取失败",
	5003: "举报信息获取失败",
	5004: "本周恶意举报次数过多",
	9999: "服务器连接失败",
}

func New(code int) *Error {
	return &Error{Code: code, Msg: errorMessage[code]}
}
